zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_FLASH.h
#define FLASH_MCR_WDIE_MASK                      (0x1000U)
#define FLASH_MCR_WDIE_SHIFT                     (12U)
#define FLASH_MCR_WDIE_WIDTH                     (1U)
#define FLASH_MCR_WDIE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCR_WDIE_SHIFT)) & FLASH_MCR_WDIE_MASK)

#define FLASH_MCR_PECIE_MASK                     (0x8000U)
#define FLASH_MCR_PECIE_SHIFT                    (15U)
#define FLASH_MCR_PECIE_WIDTH                    (1U)
#define FLASH_MCR_PECIE(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_MCR_PECIE_SHIFT)) & FLASH_MCR_PECIE_MASK)

#define FLASH_MCR_PEID_MASK                      (0xFF0000U)
#define FLASH_MCR_PEID_SHIFT                     (16U)
#define FLASH_MCR_PEID_WIDTH                     (8U)
#define FLASH_MCR_PEID(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCR_PEID_SHIFT)) & FLASH_MCR_PEID_MASK)
/*! @} */

/*! @name MCRS - Module Configuration Status */
/*! @{ */

#define FLASH_MCRS_RE_MASK                       (0x1U)
#define FLASH_MCRS_RE_SHIFT                      (0U)
#define FLASH_MCRS_RE_WIDTH                      (1U)
#define FLASH_MCRS_RE(x)                         (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_RE_SHIFT)) & FLASH_MCRS_RE_MASK)

#define FLASH_MCRS_TSPELOCK_MASK                 (0x100U)
#define FLASH_MCRS_TSPELOCK_SHIFT                (8U)
#define FLASH_MCRS_TSPELOCK_WIDTH                (1U)
#define FLASH_MCRS_TSPELOCK(x)                   (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_TSPELOCK_SHIFT)) & FLASH_MCRS_TSPELOCK_MASK)

#define FLASH_MCRS_EPEG_MASK                     (0x200U)
#define FLASH_MCRS_EPEG_SHIFT                    (9U)
#define FLASH_MCRS_EPEG_WIDTH                    (1U)
#define FLASH_MCRS_EPEG(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_EPEG_SHIFT)) & FLASH_MCRS_EPEG_MASK)

#define FLASH_MCRS_WDI_MASK                      (0x1000U)
#define FLASH_MCRS_WDI_SHIFT                     (12U)
#define FLASH_MCRS_WDI_WIDTH                     (1U)
#define FLASH_MCRS_WDI(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_WDI_SHIFT)) & FLASH_MCRS_WDI_MASK)

#define FLASH_MCRS_PEG_MASK                      (0x4000U)
#define FLASH_MCRS_PEG_SHIFT                     (14U)
#define FLASH_MCRS_PEG_WIDTH                     (1U)
#define FLASH_MCRS_PEG(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_PEG_SHIFT)) & FLASH_MCRS_PEG_MASK)

#define FLASH_MCRS_DONE_MASK                     (0x8000U)
#define FLASH_MCRS_DONE_SHIFT                    (15U)
#define FLASH_MCRS_DONE_WIDTH                    (1U)
#define FLASH_MCRS_DONE(x)                       (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_DONE_SHIFT)) & FLASH_MCRS_DONE_MASK)

#define FLASH_MCRS_PES_MASK                      (0x10000U)
#define FLASH_MCRS_PES_SHIFT                     (16U)
#define FLASH_MCRS_PES_WIDTH                     (1U)
#define FLASH_MCRS_PES(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_PES_SHIFT)) & FLASH_MCRS_PES_MASK)

#define FLASH_MCRS_PEP_MASK                      (0x20000U)
#define FLASH_MCRS_PEP_SHIFT                     (17U)
#define FLASH_MCRS_PEP_WIDTH                     (1U)
#define FLASH_MCRS_PEP(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_PEP_SHIFT)) & FLASH_MCRS_PEP_MASK)

#define FLASH_MCRS_RWE_MASK                      (0x100000U)
#define FLASH_MCRS_RWE_SHIFT                     (20U)
#define FLASH_MCRS_RWE_WIDTH                     (1U)
#define FLASH_MCRS_RWE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_RWE_SHIFT)) & FLASH_MCRS_RWE_MASK)

#define FLASH_MCRS_RRE_MASK                      (0x1000000U)
#define FLASH_MCRS_RRE_SHIFT                     (24U)
#define FLASH_MCRS_RRE_WIDTH                     (1U)
#define FLASH_MCRS_RRE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_RRE_SHIFT)) & FLASH_MCRS_RRE_MASK)

#define FLASH_MCRS_RVE_MASK                      (0x2000000U)
#define FLASH_MCRS_RVE_SHIFT                     (25U)
#define FLASH_MCRS_RVE_WIDTH                     (1U)
#define FLASH_MCRS_RVE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_RVE_SHIFT)) & FLASH_MCRS_RVE_MASK)

#define FLASH_MCRS_EEE_MASK                      (0x10000000U)
#define FLASH_MCRS_EEE_SHIFT                     (28U)
#define FLASH_MCRS_EEE_WIDTH                     (1U)
#define FLASH_MCRS_EEE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_EEE_SHIFT)) & FLASH_MCRS_EEE_MASK)

#define FLASH_MCRS_AEE_MASK                      (0x20000000U)
#define FLASH_MCRS_AEE_SHIFT                     (29U)
#define FLASH_MCRS_AEE_WIDTH                     (1U)
#define FLASH_MCRS_AEE(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_AEE_SHIFT)) & FLASH_MCRS_AEE_MASK)

#define FLASH_MCRS_SBC_MASK                      (0x40000000U)
#define FLASH_MCRS_SBC_SHIFT                     (30U)
#define FLASH_MCRS_SBC_WIDTH                     (1U)
#define FLASH_MCRS_SBC(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_SBC_SHIFT)) & FLASH_MCRS_SBC_MASK)

#define FLASH_MCRS_EER_MASK                      (0x80000000U)
#define FLASH_MCRS_EER_SHIFT                     (31U)
#define FLASH_MCRS_EER_WIDTH                     (1U)
#define FLASH_MCRS_EER(x)                        (((uint32_t)(((uint32_t)(x)) << FLASH_MCRS_EER_SHIFT)) & FLASH_MCRS_EER_MASK)
/*! @} */

/*! @name MCRE - Extended Module Configuration */
/*! @{ */

#define FLASH_MCRE_n256K_MASK                    (0xC0U)
#define FLASH_MCRE_n256K_SHIFT                   (6U)
#define FLASH_MCRE_n256K_WIDTH                   (2U)
#define FLASH_MCRE_n256K(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_MCRE_n256K_SHIFT)) & FLASH_MCRE_n256K_MASK)

#define FLASH_MCRE_n512K_MASK                    (0xC000U)
#define FLASH_MCRE_n512K_SHIFT                   (14U)
#define FLASH_MCRE_n512K_WIDTH                   (2U)
#define FLASH_MCRE_n512K(x)                      (((uint32_t)(((uint32_t)(x)) << FLASH_MCRE_n512K_SHIFT)) & FLASH_MCRE_n512K_MASK)

